RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL27Z644/include/MKL27Z644_extension.h
/*! @brief Set the USBRESMEN field to a new value. */
#define USB_WR_USBTRC0_USBRESMEN(base, value) (USB_RMW_USBTRC0(base, USB_USBTRC0_USBRESMEN_MASK, USB_USBTRC0_USBRESMEN(value)))
#define USB_BWR_USBTRC0_USBRESMEN(base, value) (BME_BFI8(&USB_USBTRC0_REG(base), ((uint8_t)(value) << USB_USBTRC0_USBRESMEN_SHIFT), USB_USBTRC0_USBRESMEN_SHIFT, USB_USBTRC0_USBRESMEN_WIDTH))
/*@}*/

/*!
 * @name Register USB_USBTRC0, field USBRESET[7] (WO)
 *
 * Generates a hard reset to USB. After this bit is set and the reset occurs,
 * this bit is automatically cleared. This bit is always read as zero. Wait two USB
 * clock cycles after setting this bit.
 *
 * Values:
 * - 0b0 - Normal USB module operation.
 * - 0b1 - Returns the USB module to its reset state.
 */
/*@{*/
/*! @brief Set the USBRESET field to a new value. */
#define USB_WR_USBTRC0_USBRESET(base, value) (USB_RMW_USBTRC0(base, USB_USBTRC0_USBRESET_MASK, USB_USBTRC0_USBRESET(value)))
#define USB_BWR_USBTRC0_USBRESET(base, value) (USB_WR_USBTRC0_USBRESET(base, value))
/*@}*/

/*******************************************************************************
 * USB_USBFRMADJUST - Frame Adjust Register
 ******************************************************************************/

/*!
 * @brief USB_USBFRMADJUST - Frame Adjust Register (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire USB_USBFRMADJUST register
 */
/*@{*/
#define USB_RD_USBFRMADJUST(base) (USB_USBFRMADJUST_REG(base))
#define USB_WR_USBFRMADJUST(base, value) (USB_USBFRMADJUST_REG(base) = (value))
#define USB_RMW_USBFRMADJUST(base, mask, value) (USB_WR_USBFRMADJUST(base, (USB_RD_USBFRMADJUST(base) & ~(mask)) | (value)))
#define USB_SET_USBFRMADJUST(base, value) (BME_OR8(&USB_USBFRMADJUST_REG(base), (uint8_t)(value)))
#define USB_CLR_USBFRMADJUST(base, value) (BME_AND8(&USB_USBFRMADJUST_REG(base), (uint8_t)(~(value))))
#define USB_TOG_USBFRMADJUST(base, value) (BME_XOR8(&USB_USBFRMADJUST_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * USB_KEEP_ALIVE_CTRL - Keep Alive mode control
 ******************************************************************************/

/*!
 * @brief USB_KEEP_ALIVE_CTRL - Keep Alive mode control (RW)
 *
 * Reset value: 0x08U
 */
/*!
 * @name Constants and macros for entire USB_KEEP_ALIVE_CTRL register
 */
/*@{*/
#define USB_RD_KEEP_ALIVE_CTRL(base) (USB_KEEP_ALIVE_CTRL_REG(base))
#define USB_WR_KEEP_ALIVE_CTRL(base, value) (USB_KEEP_ALIVE_CTRL_REG(base) = (value))
#define USB_RMW_KEEP_ALIVE_CTRL(base, mask, value) (USB_WR_KEEP_ALIVE_CTRL(base, (USB_RD_KEEP_ALIVE_CTRL(base) & ~(mask)) | (value)))
#define USB_SET_KEEP_ALIVE_CTRL(base, value) (BME_OR8(&USB_KEEP_ALIVE_CTRL_REG(base), (uint8_t)(value)))
#define USB_CLR_KEEP_ALIVE_CTRL(base, value) (BME_AND8(&USB_KEEP_ALIVE_CTRL_REG(base), (uint8_t)(~(value))))
#define USB_TOG_KEEP_ALIVE_CTRL(base, value) (BME_XOR8(&USB_KEEP_ALIVE_CTRL_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual USB_KEEP_ALIVE_CTRL bitfields
 */

/*!
 * @name Register USB_KEEP_ALIVE_CTRL, field KEEP_ALIVE_EN[0] (RW)
 *
 * Global enable for USB_KEEP_ALIVE mode. When assert, usb shall enter
 * USB_KEEP_ALIVE mode after asserting ipg_stop; when de-assert, everything is same as
 * before. Reset to 0. Software RW.
 */
/*@{*/
/*! @brief Read current value of the USB_KEEP_ALIVE_CTRL_KEEP_ALIVE_EN field. */
#define USB_RD_KEEP_ALIVE_CTRL_KEEP_ALIVE_EN(base) ((USB_KEEP_ALIVE_CTRL_REG(base) & USB_KEEP_ALIVE_CTRL_KEEP_ALIVE_EN_MASK) >> USB_KEEP_ALIVE_CTRL_KEEP_ALIVE_EN_SHIFT)
#define USB_BRD_KEEP_ALIVE_CTRL_KEEP_ALIVE_EN(base) (BME_UBFX8(&USB_KEEP_ALIVE_CTRL_REG(base), USB_KEEP_ALIVE_CTRL_KEEP_ALIVE_EN_SHIFT, USB_KEEP_ALIVE_CTRL_KEEP_ALIVE_EN_WIDTH))

/*! @brief Set the KEEP_ALIVE_EN field to a new value. */
#define USB_WR_KEEP_ALIVE_CTRL_KEEP_ALIVE_EN(base, value) (USB_RMW_KEEP_ALIVE_CTRL(base, USB_KEEP_ALIVE_CTRL_KEEP_ALIVE_EN_MASK, USB_KEEP_ALIVE_CTRL_KEEP_ALIVE_EN(value)))
#define USB_BWR_KEEP_ALIVE_CTRL_KEEP_ALIVE_EN(base, value) (BME_BFI8(&USB_KEEP_ALIVE_CTRL_REG(base), ((uint8_t)(value) << USB_KEEP_ALIVE_CTRL_KEEP_ALIVE_EN_SHIFT), USB_KEEP_ALIVE_CTRL_KEEP_ALIVE_EN_SHIFT, USB_KEEP_ALIVE_CTRL_KEEP_ALIVE_EN_WIDTH))
/*@}*/

/*!
 * @name Register USB_KEEP_ALIVE_CTRL, field OWN_OVERRD_EN[1] (RW)
 *
 * When set to 1, during KEEP_ALIVE mode, if received token is not SETUP, the
 * OWN bit of current BD will be forced to 0, so usb core will response with NAK.
 * Reset to 0. Software RW.
 */
/*@{*/
/*! @brief Read current value of the USB_KEEP_ALIVE_CTRL_OWN_OVERRD_EN field. */
#define USB_RD_KEEP_ALIVE_CTRL_OWN_OVERRD_EN(base) ((USB_KEEP_ALIVE_CTRL_REG(base) & USB_KEEP_ALIVE_CTRL_OWN_OVERRD_EN_MASK) >> USB_KEEP_ALIVE_CTRL_OWN_OVERRD_EN_SHIFT)
#define USB_BRD_KEEP_ALIVE_CTRL_OWN_OVERRD_EN(base) (BME_UBFX8(&USB_KEEP_ALIVE_CTRL_REG(base), USB_KEEP_ALIVE_CTRL_OWN_OVERRD_EN_SHIFT, USB_KEEP_ALIVE_CTRL_OWN_OVERRD_EN_WIDTH))

/*! @brief Set the OWN_OVERRD_EN field to a new value. */
#define USB_WR_KEEP_ALIVE_CTRL_OWN_OVERRD_EN(base, value) (USB_RMW_KEEP_ALIVE_CTRL(base, USB_KEEP_ALIVE_CTRL_OWN_OVERRD_EN_MASK, USB_KEEP_ALIVE_CTRL_OWN_OVERRD_EN(value)))
#define USB_BWR_KEEP_ALIVE_CTRL_OWN_OVERRD_EN(base, value) (BME_BFI8(&USB_KEEP_ALIVE_CTRL_REG(base), ((uint8_t)(value) << USB_KEEP_ALIVE_CTRL_OWN_OVERRD_EN_SHIFT), USB_KEEP_ALIVE_CTRL_OWN_OVERRD_EN_SHIFT, USB_KEEP_ALIVE_CTRL_OWN_OVERRD_EN_WIDTH))
/*@}*/

/*!
 * @name Register USB_KEEP_ALIVE_CTRL, field STOP_ACK_DLY_EN[2] (RW)
 *
 * When set to 1, will respond the ipg_stop when usb core state is idle and no
 * AHB transfer; when set to 0, will respond the ipg_stop when no AHB transfer.
 * Reset to 0. Software read/write.
 *
 * Values:
 * - 0b0 - Enter KEEP_ALIVE mode until the USB core is idle and there is no USB
 *     AHB transfer.
 * - 0b1 - Enter KEEP_ALIVE mode immediately when there is no USB AHB transfer.
 */
/*@{*/
/*! @brief Read current value of the USB_KEEP_ALIVE_CTRL_STOP_ACK_DLY_EN field. */
#define USB_RD_KEEP_ALIVE_CTRL_STOP_ACK_DLY_EN(base) ((USB_KEEP_ALIVE_CTRL_REG(base) & USB_KEEP_ALIVE_CTRL_STOP_ACK_DLY_EN_MASK) >> USB_KEEP_ALIVE_CTRL_STOP_ACK_DLY_EN_SHIFT)
#define USB_BRD_KEEP_ALIVE_CTRL_STOP_ACK_DLY_EN(base) (BME_UBFX8(&USB_KEEP_ALIVE_CTRL_REG(base), USB_KEEP_ALIVE_CTRL_STOP_ACK_DLY_EN_SHIFT, USB_KEEP_ALIVE_CTRL_STOP_ACK_DLY_EN_WIDTH))

/*! @brief Set the STOP_ACK_DLY_EN field to a new value. */
#define USB_WR_KEEP_ALIVE_CTRL_STOP_ACK_DLY_EN(base, value) (USB_RMW_KEEP_ALIVE_CTRL(base, USB_KEEP_ALIVE_CTRL_STOP_ACK_DLY_EN_MASK, USB_KEEP_ALIVE_CTRL_STOP_ACK_DLY_EN(value)))
#define USB_BWR_KEEP_ALIVE_CTRL_STOP_ACK_DLY_EN(base, value) (BME_BFI8(&USB_KEEP_ALIVE_CTRL_REG(base), ((uint8_t)(value) << USB_KEEP_ALIVE_CTRL_STOP_ACK_DLY_EN_SHIFT), USB_KEEP_ALIVE_CTRL_STOP_ACK_DLY_EN_SHIFT, USB_KEEP_ALIVE_CTRL_STOP_ACK_DLY_EN_WIDTH))
/*@}*/

/*!
 * @name Register USB_KEEP_ALIVE_CTRL, field AHB_DLY_EN[3] (RW)
 *
 * Must be set to 1 to delay the first USB AHB bus transfer until after the USB
 * has exited KEEP_ALIVE mode.
 *
 * Values:
 * - 0b0 - Do not delay the USB AHB transfer if the USB AHB transfer occurs
 *     while exiting KEEP_ALIVE mode.
 * - 0b1 - Delay the USB AHB transfer until the clock is recovered, if the USB
 *     AHB transfer occurs while exiting KEEP_ALIVE mode.
 */
/*@{*/
/*! @brief Read current value of the USB_KEEP_ALIVE_CTRL_AHB_DLY_EN field. */
#define USB_RD_KEEP_ALIVE_CTRL_AHB_DLY_EN(base) ((USB_KEEP_ALIVE_CTRL_REG(base) & USB_KEEP_ALIVE_CTRL_AHB_DLY_EN_MASK) >> USB_KEEP_ALIVE_CTRL_AHB_DLY_EN_SHIFT)
#define USB_BRD_KEEP_ALIVE_CTRL_AHB_DLY_EN(base) (BME_UBFX8(&USB_KEEP_ALIVE_CTRL_REG(base), USB_KEEP_ALIVE_CTRL_AHB_DLY_EN_SHIFT, USB_KEEP_ALIVE_CTRL_AHB_DLY_EN_WIDTH))

/*! @brief Set the AHB_DLY_EN field to a new value. */
#define USB_WR_KEEP_ALIVE_CTRL_AHB_DLY_EN(base, value) (USB_RMW_KEEP_ALIVE_CTRL(base, USB_KEEP_ALIVE_CTRL_AHB_DLY_EN_MASK, USB_KEEP_ALIVE_CTRL_AHB_DLY_EN(value)))
#define USB_BWR_KEEP_ALIVE_CTRL_AHB_DLY_EN(base, value) (BME_BFI8(&USB_KEEP_ALIVE_CTRL_REG(base), ((uint8_t)(value) << USB_KEEP_ALIVE_CTRL_AHB_DLY_EN_SHIFT), USB_KEEP_ALIVE_CTRL_AHB_DLY_EN_SHIFT, USB_KEEP_ALIVE_CTRL_AHB_DLY_EN_WIDTH))
/*@}*/

/*!
 * @name Register USB_KEEP_ALIVE_CTRL, field WAKE_INT_EN[4] (RW)
 *
 * Set to 1 to enable WAKE_INT_STS. Reset to 0. Software RW.
 */
/*@{*/
/*! @brief Read current value of the USB_KEEP_ALIVE_CTRL_WAKE_INT_EN field. */
#define USB_RD_KEEP_ALIVE_CTRL_WAKE_INT_EN(base) ((USB_KEEP_ALIVE_CTRL_REG(base) & USB_KEEP_ALIVE_CTRL_WAKE_INT_EN_MASK) >> USB_KEEP_ALIVE_CTRL_WAKE_INT_EN_SHIFT)
#define USB_BRD_KEEP_ALIVE_CTRL_WAKE_INT_EN(base) (BME_UBFX8(&USB_KEEP_ALIVE_CTRL_REG(base), USB_KEEP_ALIVE_CTRL_WAKE_INT_EN_SHIFT, USB_KEEP_ALIVE_CTRL_WAKE_INT_EN_WIDTH))

