RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL27Z644/include/MKL27Z644_extension.h
/*! @brief Set the WAKE_INT_EN field to a new value. */
#define USB_WR_KEEP_ALIVE_CTRL_WAKE_INT_EN(base, value) (USB_RMW_KEEP_ALIVE_CTRL(base, USB_KEEP_ALIVE_CTRL_WAKE_INT_EN_MASK, USB_KEEP_ALIVE_CTRL_WAKE_INT_EN(value)))
#define USB_BWR_KEEP_ALIVE_CTRL_WAKE_INT_EN(base, value) (BME_BFI8(&USB_KEEP_ALIVE_CTRL_REG(base), ((uint8_t)(value) << USB_KEEP_ALIVE_CTRL_WAKE_INT_EN_SHIFT), USB_KEEP_ALIVE_CTRL_WAKE_INT_EN_SHIFT, USB_KEEP_ALIVE_CTRL_WAKE_INT_EN_WIDTH))
/*@}*/

/*!
 * @name Register USB_KEEP_ALIVE_CTRL, field WAKE_INT_STS[7] (RO)
 *
 * It will be set when KEEP_ALIVE mode is enabled. A SETUP token or software
 * assigned token is received. This interrupt will only be set when the token is
 * processed and USB state is IDLE. Reset to 0. software RW 1 to clear.
 */
/*@{*/
/*! @brief Read current value of the USB_KEEP_ALIVE_CTRL_WAKE_INT_STS field. */
#define USB_RD_KEEP_ALIVE_CTRL_WAKE_INT_STS(base) ((USB_KEEP_ALIVE_CTRL_REG(base) & USB_KEEP_ALIVE_CTRL_WAKE_INT_STS_MASK) >> USB_KEEP_ALIVE_CTRL_WAKE_INT_STS_SHIFT)
#define USB_BRD_KEEP_ALIVE_CTRL_WAKE_INT_STS(base) (BME_UBFX8(&USB_KEEP_ALIVE_CTRL_REG(base), USB_KEEP_ALIVE_CTRL_WAKE_INT_STS_SHIFT, USB_KEEP_ALIVE_CTRL_WAKE_INT_STS_WIDTH))
/*@}*/

/*******************************************************************************
 * USB_KEEP_ALIVE_WKCTRL - Keep Alive mode wakeup control
 ******************************************************************************/

/*!
 * @brief USB_KEEP_ALIVE_WKCTRL - Keep Alive mode wakeup control (RW)
 *
 * Reset value: 0x01U
 */
/*!
 * @name Constants and macros for entire USB_KEEP_ALIVE_WKCTRL register
 */
/*@{*/
#define USB_RD_KEEP_ALIVE_WKCTRL(base) (USB_KEEP_ALIVE_WKCTRL_REG(base))
#define USB_WR_KEEP_ALIVE_WKCTRL(base, value) (USB_KEEP_ALIVE_WKCTRL_REG(base) = (value))
#define USB_RMW_KEEP_ALIVE_WKCTRL(base, mask, value) (USB_WR_KEEP_ALIVE_WKCTRL(base, (USB_RD_KEEP_ALIVE_WKCTRL(base) & ~(mask)) | (value)))
#define USB_SET_KEEP_ALIVE_WKCTRL(base, value) (BME_OR8(&USB_KEEP_ALIVE_WKCTRL_REG(base), (uint8_t)(value)))
#define USB_CLR_KEEP_ALIVE_WKCTRL(base, value) (BME_AND8(&USB_KEEP_ALIVE_WKCTRL_REG(base), (uint8_t)(~(value))))
#define USB_TOG_KEEP_ALIVE_WKCTRL(base, value) (BME_XOR8(&USB_KEEP_ALIVE_WKCTRL_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual USB_KEEP_ALIVE_WKCTRL bitfields
 */

/*!
 * @name Register USB_KEEP_ALIVE_WKCTRL, field WAKE_ON_THIS[3:0] (RW)
 *
 * Software configure it to which token can wakeup usb during KEEP_ALIVE mode.
 * Reset to 4'b0001, software RW.
 *
 * Values:
 * - 0b0001 - Wake up on receiving OUT/SETUP token packet.
 * - 0b1101 - Wake up on receiving SETUP token packet.All other values are
 *     reserved.
 */
/*@{*/
/*! @brief Read current value of the USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS field. */
#define USB_RD_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS(base) ((USB_KEEP_ALIVE_WKCTRL_REG(base) & USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS_MASK) >> USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS_SHIFT)
#define USB_BRD_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS(base) (BME_UBFX8(&USB_KEEP_ALIVE_WKCTRL_REG(base), USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS_SHIFT, USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS_WIDTH))

/*! @brief Set the WAKE_ON_THIS field to a new value. */
#define USB_WR_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS(base, value) (USB_RMW_KEEP_ALIVE_WKCTRL(base, USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS_MASK, USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS(value)))
#define USB_BWR_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS(base, value) (BME_BFI8(&USB_KEEP_ALIVE_WKCTRL_REG(base), ((uint8_t)(value) << USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS_SHIFT), USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS_SHIFT, USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS_WIDTH))
/*@}*/

/*!
 * @name Register USB_KEEP_ALIVE_WKCTRL, field WAKE_ENDPT[7:4] (RO)
 *
 * Indicates which endpoint causes the wakeup interrupt. Reset to 0, software
 * read only.
 */
/*@{*/
/*! @brief Read current value of the USB_KEEP_ALIVE_WKCTRL_WAKE_ENDPT field. */
#define USB_RD_KEEP_ALIVE_WKCTRL_WAKE_ENDPT(base) ((USB_KEEP_ALIVE_WKCTRL_REG(base) & USB_KEEP_ALIVE_WKCTRL_WAKE_ENDPT_MASK) >> USB_KEEP_ALIVE_WKCTRL_WAKE_ENDPT_SHIFT)
#define USB_BRD_KEEP_ALIVE_WKCTRL_WAKE_ENDPT(base) (BME_UBFX8(&USB_KEEP_ALIVE_WKCTRL_REG(base), USB_KEEP_ALIVE_WKCTRL_WAKE_ENDPT_SHIFT, USB_KEEP_ALIVE_WKCTRL_WAKE_ENDPT_WIDTH))
/*@}*/

/*******************************************************************************
 * USB_CLK_RECOVER_CTRL - USB Clock recovery control
 ******************************************************************************/

/*!
 * @brief USB_CLK_RECOVER_CTRL - USB Clock recovery control (RW)
 *
 * Reset value: 0x00U
 *
 * Signals in this register control the crystal-less USB clock mode in which the
 * internal IRC48M oscillator is tuned to match the clock extracted from the
 * incoming USB data stream. The IRC48M internal oscillator module must be enabled
 * in register USB_CLK_RECOVER_IRC_EN for this mode.
 */
/*!
 * @name Constants and macros for entire USB_CLK_RECOVER_CTRL register
 */
/*@{*/
#define USB_RD_CLK_RECOVER_CTRL(base) (USB_CLK_RECOVER_CTRL_REG(base))
#define USB_WR_CLK_RECOVER_CTRL(base, value) (USB_CLK_RECOVER_CTRL_REG(base) = (value))
#define USB_RMW_CLK_RECOVER_CTRL(base, mask, value) (USB_WR_CLK_RECOVER_CTRL(base, (USB_RD_CLK_RECOVER_CTRL(base) & ~(mask)) | (value)))
#define USB_SET_CLK_RECOVER_CTRL(base, value) (BME_OR8(&USB_CLK_RECOVER_CTRL_REG(base), (uint8_t)(value)))
#define USB_CLR_CLK_RECOVER_CTRL(base, value) (BME_AND8(&USB_CLK_RECOVER_CTRL_REG(base), (uint8_t)(~(value))))
#define USB_TOG_CLK_RECOVER_CTRL(base, value) (BME_XOR8(&USB_CLK_RECOVER_CTRL_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual USB_CLK_RECOVER_CTRL bitfields
 */

/*!
 * @name Register USB_CLK_RECOVER_CTRL, field RESTART_IFRTRIM_EN[5] (RW)
 *
 * IRC48 has a default trim fine value whose default value is factory trimmed
 * (the IFR trim value). Clock recover block tracks the accuracy of the clock 48Mhz
 * and keeps updating the trim fine value accordingly
 *
 * Values:
 * - 0b0 - Trim fine adjustment always works based on the previous updated trim
 *     fine value (default)
 * - 0b1 - Trim fine restarts from the IFR trim value whenever
 *     bus_reset/bus_resume is detected or module enable is desasserted
 */
/*@{*/
/*! @brief Read current value of the USB_CLK_RECOVER_CTRL_RESTART_IFRTRIM_EN field. */
#define USB_RD_CLK_RECOVER_CTRL_RESTART_IFRTRIM_EN(base) ((USB_CLK_RECOVER_CTRL_REG(base) & USB_CLK_RECOVER_CTRL_RESTART_IFRTRIM_EN_MASK) >> USB_CLK_RECOVER_CTRL_RESTART_IFRTRIM_EN_SHIFT)
#define USB_BRD_CLK_RECOVER_CTRL_RESTART_IFRTRIM_EN(base) (BME_UBFX8(&USB_CLK_RECOVER_CTRL_REG(base), USB_CLK_RECOVER_CTRL_RESTART_IFRTRIM_EN_SHIFT, USB_CLK_RECOVER_CTRL_RESTART_IFRTRIM_EN_WIDTH))

/*! @brief Set the RESTART_IFRTRIM_EN field to a new value. */
#define USB_WR_CLK_RECOVER_CTRL_RESTART_IFRTRIM_EN(base, value) (USB_RMW_CLK_RECOVER_CTRL(base, USB_CLK_RECOVER_CTRL_RESTART_IFRTRIM_EN_MASK, USB_CLK_RECOVER_CTRL_RESTART_IFRTRIM_EN(value)))
#define USB_BWR_CLK_RECOVER_CTRL_RESTART_IFRTRIM_EN(base, value) (BME_BFI8(&USB_CLK_RECOVER_CTRL_REG(base), ((uint8_t)(value) << USB_CLK_RECOVER_CTRL_RESTART_IFRTRIM_EN_SHIFT), USB_CLK_RECOVER_CTRL_RESTART_IFRTRIM_EN_SHIFT, USB_CLK_RECOVER_CTRL_RESTART_IFRTRIM_EN_WIDTH))
/*@}*/

/*!
 * @name Register USB_CLK_RECOVER_CTRL, field RESET_RESUME_ROUGH_EN[6] (RW)
 *
 * The clock recovery block tracks the IRC48Mhz to get an accurate 48Mhz clock.
 * It has two phases after user enables clock_recover_en bit, rough phase and
 * tracking phase. The step to fine tune the IRC 48Mhz by adjusting the trim fine
 * value is different during these two phases. The step in rough phase is larger
 * than that in tracking phase. Switch back to rough stage whenever USB bus reset
 * or bus resume occurs.
 *
 * Values:
 * - 0b0 - Always works in tracking phase after the 1st time rough to track
 *     transition (default)
 * - 0b1 - Go back to rough stage whenever bus reset or bus resume occurs
 */
/*@{*/
/*! @brief Read current value of the USB_CLK_RECOVER_CTRL_RESET_RESUME_ROUGH_EN field. */
#define USB_RD_CLK_RECOVER_CTRL_RESET_RESUME_ROUGH_EN(base) ((USB_CLK_RECOVER_CTRL_REG(base) & USB_CLK_RECOVER_CTRL_RESET_RESUME_ROUGH_EN_MASK) >> USB_CLK_RECOVER_CTRL_RESET_RESUME_ROUGH_EN_SHIFT)
#define USB_BRD_CLK_RECOVER_CTRL_RESET_RESUME_ROUGH_EN(base) (BME_UBFX8(&USB_CLK_RECOVER_CTRL_REG(base), USB_CLK_RECOVER_CTRL_RESET_RESUME_ROUGH_EN_SHIFT, USB_CLK_RECOVER_CTRL_RESET_RESUME_ROUGH_EN_WIDTH))

/*! @brief Set the RESET_RESUME_ROUGH_EN field to a new value. */
#define USB_WR_CLK_RECOVER_CTRL_RESET_RESUME_ROUGH_EN(base, value) (USB_RMW_CLK_RECOVER_CTRL(base, USB_CLK_RECOVER_CTRL_RESET_RESUME_ROUGH_EN_MASK, USB_CLK_RECOVER_CTRL_RESET_RESUME_ROUGH_EN(value)))
#define USB_BWR_CLK_RECOVER_CTRL_RESET_RESUME_ROUGH_EN(base, value) (BME_BFI8(&USB_CLK_RECOVER_CTRL_REG(base), ((uint8_t)(value) << USB_CLK_RECOVER_CTRL_RESET_RESUME_ROUGH_EN_SHIFT), USB_CLK_RECOVER_CTRL_RESET_RESUME_ROUGH_EN_SHIFT, USB_CLK_RECOVER_CTRL_RESET_RESUME_ROUGH_EN_WIDTH))
/*@}*/

/*!
 * @name Register USB_CLK_RECOVER_CTRL, field CLOCK_RECOVER_EN[7] (RW)
 *
 * This bit must be enabled if user wants to use the crystal-less USB mode for
 * the Full Speed USB controller and transceiver. This bit should not be set for
 * USB host mode or OTG.
 *
 * Values:
 * - 0b0 - Disable clock recovery block (default)
 * - 0b1 - Enable clock recovery block
 */
/*@{*/
/*! @brief Read current value of the USB_CLK_RECOVER_CTRL_CLOCK_RECOVER_EN field. */
#define USB_RD_CLK_RECOVER_CTRL_CLOCK_RECOVER_EN(base) ((USB_CLK_RECOVER_CTRL_REG(base) & USB_CLK_RECOVER_CTRL_CLOCK_RECOVER_EN_MASK) >> USB_CLK_RECOVER_CTRL_CLOCK_RECOVER_EN_SHIFT)
#define USB_BRD_CLK_RECOVER_CTRL_CLOCK_RECOVER_EN(base) (BME_UBFX8(&USB_CLK_RECOVER_CTRL_REG(base), USB_CLK_RECOVER_CTRL_CLOCK_RECOVER_EN_SHIFT, USB_CLK_RECOVER_CTRL_CLOCK_RECOVER_EN_WIDTH))

